driver-tests/sqlse/derby/selectmultiparamfullqualJbi/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sql="http://com.sun.jbi/sqlse/sqlseengine">
  <soapenv:Body>
    <sql:selectmultiparamfullqualRequest>
      <sql:param1>101</sql:param1>
      <sql:param2>nari</sql:param2>
    </sql:selectmultiparamfullqualRequest>
  </soapenv:Body>
</soapenv:Envelope>